Revit 2024 API
StructuralSectionZProfileWithLips Class
 Defines parameters for Z Profile with lips structural section.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public class StructuralSectionZProfileWithLips : StructuralSectionGeneralLZ
Visual Basic
Public Class StructuralSectionZProfileWithLips _
	Inherits StructuralSectionGeneralLZ
Visual C++
public ref class StructuralSectionZProfileWithLips : public StructuralSectionGeneralLZ
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralLZ
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionZProfileWithLips
See Also
StructuralSectionZProfileWithLips Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace